Revit.Elements.Category.ByName(System.String)
Gets a Revit category by the built-in category name.
name: The built in category name.
Returns:

Revit.Elements.Category.Name
The name of the Category.

Revit.Elements.Category.Id
The Id of the category.